# Brewfile — all dependencies, run via: brew bundle --file=~/dotfiles/Brewfile
# Add new tools here, then run ./install.sh or brew bundle

# ─── CLI tools ───────────────────────────────────────────────
brew "neovim"
brew "tmux"
brew "git-delta"
brew "lazygit"
brew "lazydocker"
brew "fnm"
brew "pipx"
brew "terminal-notifier"
brew "go"
brew "ripgrep"
brew "imagemagick"
brew "ghostscript"
brew "poppler"
brew "ruby"
brew "libpq"

# ─── Desktop apps ───────────────────────────────────────────
cask "ghostty"
cask "raycast"
cask "claude"
